app/controllers/public/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @q = User.ransack(params[:q])
    @users = User.page(params[:page]).per(10)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    if @user !=current_user
      redirect_to user_path(@user)
    else
      @user = User.find(params[:id])

UPDATE "users" SET "image_id" = ?, "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["image_id", "3cb5ad8499b91761ab445c155f56b029cf7b68d86cb04d909d59328b3228"], ["introduction", ""], ["updated_at", "2020-11-02 09:04:57.567627"], ["id", 1]]
---
  def update
    if @user != current_user
      redirect_to user_path(@user)
    else
      if @user.update(user_params)